{"meta":{"title":"오동환","subtitle":"Donghwan's Something","description":"For the man better than yesterday","author":"DongHwan","url":"https://devist.github.io"},"pages":[{"title":"","date":"2019-01-13T18:11:35.173Z","updated":"2019-01-13T18:11:35.173Z","comments":true,"path":"about/index.html","permalink":"https://devist.github.io/about/index.html","excerpt":"","text":"About Me Who i am 안녕하세요 Address It is a secret for privacy ;) Email dh-3-@naver.com Find me On Blog"}],"posts":[{"title":"Firebase Cloud Messaging","slug":"Firebase-Cloud-Messaging","date":"2019-01-13T17:28:27.000Z","updated":"2019-01-13T17:28:48.436Z","comments":true,"path":"2019/01/14/Firebase-Cloud-Messaging/","link":"","permalink":"https://devist.github.io/2019/01/14/Firebase-Cloud-Messaging/","excerpt":"","text":"","categories":[{"name":"Firebase","slug":"firebase","permalink":"https://devist.github.io/categories/firebase/"}],"tags":[]},{"title":"jenkins with gcp","slug":"jenkins-with-gcp","date":"2019-01-13T17:21:12.000Z","updated":"2019-01-13T17:23:15.802Z","comments":true,"path":"2019/01/14/jenkins-with-gcp/","link":"","permalink":"https://devist.github.io/2019/01/14/jenkins-with-gcp/","excerpt":"","text":"","categories":[{"name":"Cloud","slug":"cloud","permalink":"https://devist.github.io/categories/cloud/"},{"name":"CI/CD","slug":"cloud/ci-cd","permalink":"https://devist.github.io/categories/cloud/ci-cd/"}],"tags":[{"name":"jenkins","slug":"jenkins","permalink":"https://devist.github.io/tags/jenkins/"},{"name":"gcp","slug":"gcp","permalink":"https://devist.github.io/tags/gcp/"},{"name":"ci","slug":"ci","permalink":"https://devist.github.io/tags/ci/"},{"name":"cd","slug":"cd","permalink":"https://devist.github.io/tags/cd/"}]},{"title":"2018년 회고하기","slug":"Retrospect-for-2018","date":"2019-01-13T17:10:03.000Z","updated":"2019-01-14T09:59:38.690Z","comments":true,"path":"2019/01/14/Retrospect-for-2018/","link":"","permalink":"https://devist.github.io/2019/01/14/Retrospect-for-2018/","excerpt":"","text":"2018년2018년은 업무적으로도, 개인의 삶을 돌아보아도 아쉬움이 남는, 색깔 없는 한 해였다. 반성이 필요한 한 해였다. 업무적으로는, 물론 매일 조금씩 나아지긴 했다. ES6 를 학습하고, Vue.js 프레임워크를 사용할 수 있게 되고, Kotlin으로 안드로이드 앱 개발이 가능해졌다. 그러나 입사 후 점점 기술 스펙트럼은 넓어지지만, 깊이를 가질 수 없게 되어가고 있다. 근 2년 동안 운영-&gt;안드로이드 앱개발-&gt;하이브리드앱 개발-&gt;PM-&gt;마케팅-&gt;일부 풀스택 웹 개발 등 정말 다양한 일을 해왔다. 이렇게 물 흐르듯, 스쳐가며 배우는 것들이 과연 내게 도움이 될까. 전문성을 키우지 못하고 기술적으로 정체 또는 퇴보하고 있다는 아쉬움이 드는 한편, 평생 직장인을 할 자신도 없는 나이므로, 오히려 추후 창업할 때에는 이런 경험이 도움이 되지 않을까 애써 위로해본다. 삶적으로는, 너무나도 게으르고 무기력했다. 배고플 때 먹고, 운동은 거의 하지 않는 상태로 30대로 진입까지 해버리니 예전만큼 팔팔하지 못하다는게 내 스스로도 느껴진다. 또한 여가 시간을 투자해서 했던 일들도 뜻대로 되지 않았으며, 열심히 투자한 시간만큼 하고 싶었던 다른 일들(학습, 운동 등)은 아예 뒷전이었던 것 같다. 연고 없는 타지역에 와서, 더 적극적으로 주변을 챙겨야 했음에도 불구하고, 먼저 연락하여 챙기기는 커녕 오는 연락에도 귀찮아하며 말도 안되는 핑계로 거절하는 일이 다반사였다. 망한 일본 오사카 여행2박3일로 잡아두었던 일본 오사카 여행. 1차적으로, 일이 생겨서 1박 2일로 변경하며 금전적 손실이 발생했다. 2차는, 이번 년도 제주도를 자주 왕래하다보니, 비행기 탑승가능시간을 제주도 갈때처럼 몇 십 분 전에도 가능할거라고 착각하여 비행기를 놓쳤다. 2차로 금전적 손실이 발생했다. 갈까말까 고민하다가 결국 다른 비행기를 끊어서 오사카로 가 친구를 만났지만, 이미 늦은 저녁이라 저녁만 먹고 끝났다. 다음날에는 교토 기온거리를 조금 관광한후 다시 한국으로 돌아오는 비행기를 타러가야했다. 3차로, 예상치 못한 일이 발생했다. 왕복권은 탑승이 취소되면, 돌아오는 항공편도 취소된다는데 몰랐다. 나는 항공권이 있는줄 알았는데, 없던 것이다! 급하게 한국 가는 항공편 예약하느라 진땀을 뺐다. 거의 당일치기와 다름없었던, 돈을 허공에 뿌리고 온 여행이라, 크게 기억에 남는다.. 이사월세에서 전세로 옮겼다. 둘 다 좁은 공간이지만, 이번에는 복층이라 조금 더 답답하지 않게 살 수 있게 되었다. 전세로 전환하며 매달 고정지출비용도 많이 아낄 수 있게 되었다. (인테리어 하느라 돈 더 쓴 거 같은 기분은 안 비밀) 결혼 Party주변에 결혼하는 사람이 해가 갈 수록 증가하는 기분이다. 많을 때는 정말 한 달 중 세 번의 주말을 결혼식장에서 보낸 것 같다. 좋아하는 사람들이 결혼하여 신혼 생활을 하는 것은 물론 기분 좋고 행복한 일이다. 그러나 매 달 최소 1회 이상 결혼식을 방문하는 건, 마냥 생각없이 기뻐할 수 없는 일이었다. 그럼에도 축하하며, 정말로 방문했던 모든 부부와 관련 지인들이 앞으로 더 행복하길 바래본다. 방송 출연우연한 계기로 그룹 방송에 출연했다. 특별한 사람이 아님에도 불구하고 나를 추천해준 회사 분들께 감사하다. 물론 촬영 시기가 좋지 않아서 원하는 모습을 못 보여드린 건 아쉽고, 또한 거의 삭발 수준이었을 때 촬영하게 된 것도 아쉽다. 그룹 방송 외에도, AI 어쩌고를 주제로 한 MBC 방송에도 내 모습이 나왔다. 하나의 점같이 나왔지만, 나온 건 나온거니까.. 하필 이사하느라 스마트폰으로 용달 부르고 있는 모습이 찍혀서 당황스러웠다..ㅋ 인생 살면서 한 번 쯤 지나가는 행인 1으로라도, TV 같은데 출연해보는게 하나의 버킷리스트였는데, 2018년에 이룬 것 같다. Nexters회사 선배의 소개로 Nexters라는 대외활동에 지원하게 되었고, 불쑥 합격했다. IT에 관심 있는 대학생들과, IT 현업에서 일하고 있는 직장인들이 모여 방학기간동안 함께 팀을 이뤄 프로젝트를 진행하는 대외활동이다. 대학생들과 같이 협업해볼 수 있어서 좋았고, 실력 좋은 현직 직장인들과 교류할 수 있어서 좋았다. 아쉽게도 이번 겨울에는 개인 사정으로 참여하지 못했지만, 19년 여름방학에는 꼭 참여해서 수료하겠다. 2019년 목표새해에는 목표와 목적을 갖고, 발전적인 삶을 살고 싶다. 더이상 늦출 수 없는 것들을 올 한 해 이뤄내고 싶다. 기술적으로 발전하기 꾸준한 블로깅 회사 프로세스 기록 안드로이드 kotlin, Rx 를 활용한 개인앱 2개 출시 회사 프로젝트에 React 적용 알고리즘 100문제 풀기 운동 한가지 시작하기 자격증 1개 취득(이번에야말로…) 금연하기(이번에야말로..) 운전 면허 취득하기(이번에야말로…) 영어 실력 키우기 스피킹 맥스 완강하여 장학금 타기","categories":[{"name":"Log","slug":"log","permalink":"https://devist.github.io/categories/log/"},{"name":"Year","slug":"log/year","permalink":"https://devist.github.io/categories/log/year/"}],"tags":[]},{"title":"비욘드 사일러스(Beyond Silence) - 인기는 인기 있어야 할까","slug":"review-movies-beyond-silence","date":"2019-01-13T16:02:33.000Z","updated":"2019-01-13T16:07:44.089Z","comments":true,"path":"2019/01/14/review-movies-beyond-silence/","link":"","permalink":"https://devist.github.io/2019/01/14/review-movies-beyond-silence/","excerpt":"","text":"비욘드 사일런스(Beyond Silence) 줄거리그냥 지나치기엔 너무나 따뜻하고 아름다운 작품. 청각장애인 부모 사이에서 태어난 라라는 그들에게는 보물과도 같은 존재다. 외부세계와 다리가 되어 모든 일을 현명하게 처리하던 귀여운 꼬마 소녀 라라. 그녀는 자라면서 음악에 관심을 기울인다. 그것도 아버지인 마틴이 싫어하는 “클라리넷” 연주자가 되기를 꿈꾼다. 이 클라리넷 연주는 마틴의 누이가 즐기던 것이었다. 태어날 때부터 청각장애자였던 마틴은 누이의 연주를 보고 경탄하는 식구들과 손님들에 의해 심한 콤플렉스를 느낄 수밖에 없었다. 성인이 된 라라는 어머니마저 죽게 되자 아버지의 심한 간섭을 견디지 못하고 베를린에서 음악 수업을 하기로 결심한다. “침묵을 넘어서”라고 번역될 이 영화의 제목은 모든 것을 말해준다. 아버지와 딸이 침묵을 넘어 서로 이해할 수 있을까. 더 나아가 관객들은 소리없는 청각장애자들의 세계를 이해할 수 있을까. 결말 부분이 다소 상투적이긴 하지만 적잖은 질문과 고민을 전해줄 만한 아름다운 드라마다. 인기는 인기 있어야 할까인기 있고 싶어 하는 사람은 왜 그런 걸까. 만약 내가 인기 있고 싶었다면? 이유는, 즐겁고 싶고, 행복하고 싶어서가 아닐까 생각한다. 소크라테스식 사고방식으로 생각해보자. 인기 있음은 행복하다. 하지만, 인기 없어도 행복한 사람이 존재하지 않을까? 인기 있어도 행복하지 않은 사람은 없는 걸까? 두 가지 물음 모두 존재할 거라는 생각이 든다. 시작하자마자 오류가 존재한다. 영화 ‘비욘드 사일런스’의 주인공 라라는 소리를 듣지 못하는 아버지와 잦은 충돌을 일으킨다. 꿈을 위해 가족을 떠나 고모와 지냈다. 아버지는 ‘자신의 꿈만 생각하고 가족을 떠나는 건 이기심이다’라고 한다. 하지만 라라는 그런 비난을 극복하고, 극적으로 아버지의 이해를 받아낸다. 이것은 라라가 자신만의 생각, 신념이 있었기 때문에 휩쓸리지 않고 자신의 길을 갔기 때문이라고 생각한다. 자신이 잘못되었다는 비난에 그대로 포기하지 않는 것도 이 때문에 가능했던 것이리라. 여기서 ‘영화와 철학’ 시간에 배운 인기 없는 사람들에 대해서도 생각해 볼 수 있지 않을까. 그녀는 비록 또래 친구들에게 인기는 없을지라도, 자신의 꿈을 실천하는 중이므로 행복할 것 같다. ‘인기가 없어도 행복하다’라는 사람이 존재하는 것이다. 고모 클라레스를 생각해보면, 그녀의 아버지에게 사랑받고, 그녀의 오빠에게는 질투를 받으며, 주인공 라라에게는 동경의 대상이 된다. 인기 있는 것이다. 하지만 영화에서 그녀는 행복하지 않다. ‘인기는 있지만 행복하지 않다’는 사람이 존재하는 것이다. 나는 오래 전 철학자인 소크라테스의 도움으로 쉽게 내 생각의 오류를 찾아낼 수 있었고, 그 예를 영화에서 찾아냈다. 그러면, 인기라는 건 또 무엇인가? 인기라는 것도 두가지 종류가 있다. 하나는 자신의 확고한 신념, 생각 등이 있기 때문에 자신감 넘치고, 행동에 거침이 없기 때문에 인기가 있는 것이고, 또 하나는 세상에 굴복해 남의 비위나 맞춰 주고 순종적이어서 대하기 편하기 때문에 인기 있는 것이다. 라라가 인기 있다면 그녀의 경우는 전자가 아닐까. 영화에서 결말은 나지 않았지만, 그녀는 시험에서 좋은 연주를 펼쳤고, 그래서 합격해 유명한 음악인이 되었다면 그녀의 용기와 불굴의 의지 등 때문에 인기 있을지 모르는 일이기 때문이다. 그리고 이 경우가 더 행복할 것 같다. 이쯤 되면, 인기라는 것이 무의미해 보인다. 인기라는 것으로 행복해 질 수 있는 것도 아닌 것 같다. 또한 내가 생각한 두 종류의 인기 중 후자는 진실로 인기 있는 것 같지도 않다. 전자의 경우도 인기보다는 먼저 라라처럼 자신의 생각, 신념 등을 가지는 게 더 중요해 보인다. 결국에는 인기 없음, 있음이 문제가 아닌 것이다. ‘인기라는 게 아무 의미 없는 것이다’ 라는 생각까지 든다. 라라는 책 ‘젊은 베르테르의 기쁨’의 한 구절처럼 다른 사람의 호의를 얻으려는 욕망에서 자유로웠다. 항상 자신이 옳다고 믿는대로 행동했고, 확고한 자신의 생각을 가지고 있었다. 아버지도 결국엔 그녀를 이해해 줬으며, 그녀는 꿈을 향해 나아가고 있기에 행복하다고 생각한다. 내가 생각하는 해피엔딩의 결말대로라면, 그녀는 결국에 인기까지 얻을 것이다. 마치 소크라테스처럼. 그러기에 중요한건 나의 생각을 가꾸고 다듬어서 깊은 확신을 갖는 것이지, 한낱 인기 따위에 의미를 두어서는 안 될 것 같다. 그건 부차적인 것이므로.","categories":[{"name":"Review","slug":"review","permalink":"https://devist.github.io/categories/review/"},{"name":"Movies","slug":"review/movies","permalink":"https://devist.github.io/categories/review/movies/"}],"tags":[]},{"title":"카페 꼼마에서 만난 책, '변신'","slug":"review-book-1","date":"2019-01-13T15:25:05.000Z","updated":"2019-01-13T17:39:47.321Z","comments":true,"path":"2019/01/14/review-book-1/","link":"","permalink":"https://devist.github.io/2019/01/14/review-book-1/","excerpt":"","text":"사전 참가 등록했었던 ‘ICT DREAM CONCERT ‘가 9월 2일 홍대에 있는 카페 꼼마에서 열렸다.카페에 도착했더니, 이 카페에서는 책을 무려 50%나 할인된 금액으로 구입할 수 있었다!흥분된 마음으로 바로 어떤 책을 살지 고민에 들어갔는데, 알고보니 꼼마에서는 문학동네의 책만 취급하고 있었다.그래서 원래 구입하고 싶었던 책 대신 만나게 된 책이 ‘변신’ 이다.변신. 살다 보면 누구나 한번쯤 꿈꾸어보지 않았을까.어린 시절 하늘을 날아보고 싶어 ‘새’로 변신한 내 모습을 상상해보기도 했고,한창 운동을 하던 시절에는 시합 도중 능력만 ‘사범’님으로 변신해서 금메달을 목에 거는 내 모습을 꿈꾸기도 했었다.이 책에는 어떤 ‘변신’이 기다리고 있을까? 책을 반값에 구입한 사실만큼이나 이러한 상상 또한 즐거웠다. “그레고르는 고개를 돌려 아버지를 쳐다보았다. 지금 저기 서 있는 저런 아버지의 모습은 정말이지상상조차 해본 적이 없었다. (중략) 그러나 아무리 그렇다고 해도 과연 저 사람이 아버지란 말인가?예전에 그레고르가 출장을 떠날 때면 늘 지친 모습으로 침대에 파묻혀 누워 있던 바로 그 사람이 맞는 걸까?” -83페이지그레고르가 벌레로 변신한 후에 그레고르의 아버지, 어머니, 여동생은 새로운 상황에 직면하게 된다.그레고르처럼 극단적인 변신은 아니지만, 그들 또한 나름대로 놀랄만한 변신을 하게 되는 것이다.집 안의 든든한 기둥이던 그레고르가 본인의 역할을 못하게 됨으로서 힘들어 하기도 하지만 결국엔 적응하고 방법을 모색한다.가끔씩은 오히려 더 행복해보이기까지 한다.이런 그들의 ‘변신’을 보면서 기대는 삶, 기댈 곳이 있는 삶, 역할 등에 대해 많은 생각을 해보았다. 고전 입문자에게 추천할만한 책, ‘변신’이 소설은 길지 않다. 그림도 꽤 많은데 그림을 포함하고, 옮긴이의 말까지 포함해도 137페이지 밖에 안 된다.짧은 시간 안에 읽을 수 있다. 한 권의 책을 읽고 나면 다른 이들의 리뷰 한 두개 정도는 꼭 읽게 되곤 한다.책을 읽는 것 자체도 재밌지만, 같은 책을 읽고 다른 사람들은 어떻게 느꼈는지,이 책이 가지는 의미가 무엇인지 알아보는 과정 또한 의미있고 재미있다고 생각하기 때문이다.이번에도 책 뒷편에 나와 있는 ‘옮긴이의 말’을 통해서 이 소설에 대해 더 많이 알게 됐다. 고전은 읽다 보면 문장이 어렵다거나, 부분적으로 내용이 지루하게 느껴지는 등의 이유로 쉽게 읽히지 않는다.하지만 이 소설은 길지 않고, 인간에서 벌레로 변신한 인간 이야기라는 흥미로운 주제로 이야기를 풀어나가기 때문에단숨에 끝까지 읽을 수 있었다.거기다가 이 책의 적절한 그림과 이야기를 재미있게 읽고 난 후 뒤에 덧붙인 옮긴이의 해설까지 읽고 나면,이 소설에 담긴 의미를 다양한 관점에서 바라볼 수 잇다.나처럼 고전을 읽어본 경험이 적은 입문자에게 추천해줄 수 있을만한 책이다.그레고르의 아버지 입장에서, 어머니 입장에서, 여동생의 입장에 서서 이 소설을 읽는 것도 재미있다.","categories":[{"name":"Review","slug":"review","permalink":"https://devist.github.io/categories/review/"},{"name":"Books","slug":"review/books","permalink":"https://devist.github.io/categories/review/books/"}],"tags":[]}]}